from pathlib import Path

BASE_DIR = Path(__file__).parent

WELCOME_MESSAGE = ('Здравствуйте, {welcome_name}\n'
                   'Я - SciComBot, и я провожу отбор кандидатов в научную роту.\n'
                   'Выберете интересующий Вас раздел 👇')

MILITARY_RECRUITMENT = 'На какой призыв Вы хотите оставить заявку?'

TELEGRAM_CHANNEL = 'https://t.me/+ntFED2PMwUo2MDZi'

CONSULTANT_URL = 'https://www.consultant.ru/document/cons_doc_LAW_18260/'

FEDERAL_ACT = 'ФЗ № 53 «О воинской обязанности и военной службе» от 28.03.1998 (ред. 02.10.2024)'

QUESTION_TEXT = 'Спасибо за вопрос, он добавлен в базу. В скором времени на него ответят и вам придет уведомление.'

NO_NATIONALITY_TEXT = ('Извините, наличие гражданства Российской Федерации '
                       'является обязательным условием для отбора в научную роту')

EDUCATION = 'Имеется ли у Вас оконченное высшее техническое образование?'

NO_EDUCATION = ('Извините, наличие Высшего технического образования '
                'является обязательным условием для отбора в научную роту')

MILITARY_SERVICE = (
    'В Соответствии с положениями п.п."а", пункта 1, статьи 22 \"Граждане, подлежащие призыву на военную службу\"'
    '\nФедерального закона от 28.03.1998 N 53-ФЗ (ред. от 02.10.2024) \"О воинской обязанности и военной службе\",'
    'призыву  на  военную службу подлежат граждане мужского пола в возрасте от 18 до 30 лет, состоящие на воинском учете '
    'или не состоящие, но обязанные состоять на воинском учете и не пребывающие в запасе '
)
