from pathlib import Path

BASE_DIR = Path(__file__).parent

WELCOME_MESSAGE = ('Здравствуйте, {welcome_name}\n'
                   'Я - SciComBot, и я провожу отбор кандидатов в научную роту.\n'
                   'Выберете интересующий Вас раздел 👇')

MILITARY_RECRUITMENT = 'На какой призыв Вы хотите оставить заявку?'

TELEGRAM_CHANNEL = 'https://t.me/+ntFED2PMwUo2MDZi'

CONSULTANT_URL = 'https://www.consultant.ru/document/cons_doc_LAW_18260/'

FEDERAL_ACT = 'ФЗ № 53 «О воинской обязанности и военной службе» от 28.03.1998 (ред. 02.10.2024)'

QUESTION_TEXT = 'Спасибо за вопрос, он добавлен в базу. В скором времени на него ответят и вам придет уведомление.'
